** Implementation details

Updating an existing change with =pushnew= doesn't work.

#+begin_src elisp
  (let ((changes '((:id 1 :name "niklas")
                   (:id 2 :name "tira"))))
    (cl-pushnew '(:id 1 :name "katarina")
                changes
                :test (lambda (a b) (equal (plist-get a :id) (plist-get b :id))))
    changes)
#+end_src

#+RESULTS:
| :id | 1 | :name | niklas |
| :id | 2 | :name | tira   |

Updating an existing change with =push= and =seq-remove=.

#+begin_src elisp
  (let ((changes '((:id 1 :name "niklas")
                   (:id 2 :name "tira")))
        (change '(:id 1 :name "katarina")))
    ;; Delete existing change
    (setq changes
          (seq-remove (lambda (it)
                        (equal (plist-get it :id)
                               (plist-get change :id)))
                      changes))
    ;; Add updated change
    (push change changes)
    changes)

#+end_src

#+RESULTS:
| :id | 1 | :name | katarina |
| :id | 2 | :name | tira     |

